[
  {
    "month": 1,
    "month_name": "January",
    "image": "ski_boot.png",
    "image_alt": "Ski Boot",
    "title": "Headwall",
    "abstract": "We crested the final pitch of the fast lift ride to the top of the resort. As a single rider, I enjoyed the silent ride, with my three lift companions chatting readily to each other in French, I’m sure. I hadn’t spoken much of it since high school, but I managed to pick a few words from the linguistic staccato of their conversation.",
    "link": "https://medium.com/@scottpdawson/chapter-1-headwall-3df4f888a2f4",
    "story": "<p>We crested the final pitch of the fast lift ride to the top of the resort. As a single rider, I enjoyed the silent ride, with my three lift companions chatting readily to each other in French, I’m sure. I hadn’t spoken much of it since high school, but I managed to pick a few words from the linguistic staccato of their conversation.</p><p>I skated quickly to the start of what would be my last run of the day. The snow was firm with patches of untouched corduroy, since it was still early by the standards of the masses. I like to get my turns in before lift lines get too crazy. I do some of my best thinking when I’m out in nature. In the springtime, it’s walks in the woods while the trees bud out and flowers bloom. In summer, running shirtless along the canal path. Fall brings the chance to get out on long, meandering bike rides. But winter? Oh, sweet winter brings skiing to me like a drug. I chase that elusive high with each subsequent run, hoping each one will be better than the last. There are some days, like today, where that is quite true. Grippy snow, a cloudless sky and sharp edges on my slalom skis put an instant smile on my face.</p><p>I gathered some speed as the slope steepened, carving tightly left and right, enjoying the lack of direction sometimes dictated by meandering novice skiers in my path. The great “mind eraser”, I termed this moment. Can’t think about work. Can’t think about relationship drama. Can’t think about tax preparation. Just pure adrenaline and joy.</p><p>It hadn’t been the easiest year, so having my mind erased was the perfect medicine. I did my best to shake off the depression I sunk into after Maribel left me, and lost myself quite readily in my work. Not that work was a happy place, either, but it was a constant companion that only I could leave, as she would never leave me. I had seen to that, by making myself indispensable. Arise, commute, work, commute, work some more, then sleep. Repeat. I lost myself in routine, trying my best to forget about the mistakes of the past. And then the weekend came, where my skis were my companion. My drug. My release.</p><p>There are many cases where you can lose yourself in thought with little consequence. Bored at a meeting? Doodle. Stuck in traffic? Daydream about real estate in Aspen. Enduring an endless conversation with a colleague? Think about lunch. But while I was flying down this hill, this sport I called a mind eraser didn’t quite do its job. My thoughts drifted back to Maribel. What had I done wrong? Why did it have to end so badly? And that’s when I skipped over an obscured chunk of ice left behind by last night’s groomer, lying in wait for my inside ski to impact it and knock me off center. It didn’t help that this chunk of ice had rested just above a steep drop: the headwall. I careened to my left as my inside ski lost its connection to the ground. I tried to compensate by attempting to lift my body from its angular posture, but there was no recovery. I felt my skis disconnect from my boots, per design, and I cartwheeled down the pitch. Time slowed. My head bounced around like a rag doll. I closed my eyes and waited out the relentless grip that gravity had on my body. As I reached the trough at the bottom of the hill, I lay motionless, staring up at that deep, blue sky.</p><p>Voices in the distance shouted at me, but the words were a blur. From the lift? Unsure. I blinked heavily, focusing on something close to my face. It was the season pass I had strapped around my calf with an elastic band. Except it was so close to my face. How would that be possible? I saw my unassuming smile in my pass photo. Below it, I made out my name, Chandler Stidwell, with the suffix, “Executive Passholder.” These words blurred as I read them, my consciousness waning. I glanced skyward again, the sky a darker blue, with some small clouds floating into my field of vision.</p><p>Dark blue turned slowly to black, and then … then there was nothing.</p>"
  },
  {
    "month": 2,
    "month_name": "February",
    "image": "cheese.png",
    "image_alt": "Cheese",
    "title": "Darkness",
    "abstract": "Darkness brings with it time to think, to contemplate what it is to “be me”, and more oftentimes that not, I’m alone in my drawer with no companions to distract me. ",
    "link": "https://medium.com/@scottpdawson/chapter-2-darkness-3e077ea8500",
    "story": "<p>I prefer the darkness of the drawer.</p><p></p><p>Darkness brings with it time to think, to contemplate what it is to “be me”, and more oftentimes that not, I’m alone in my drawer with no companions to distract me. No feta, no gruyère — not even aged slices of provolone. I’ve been plucked so many times without warning from my safe haven. Sometimes with happy memories, and sometimes not, yet always returning lighter than I left.</p><p>The happiest time was when Maribel lovingly arranged me with a few others on a blackboard slab. She wrote my name in front of me, as if people couldn’t tell by looking. Some of my companions, notably epoisses and taleggio, definitely needed their names scrawled with white chalk in front of them, lest a guest think that they were some sort of mistake. If it were up to me, I’d have taken them straight from their drawer and discarded them, such was their appearance. No matter. We were all part of a festive atmosphere, and festivity always puts me in a good mood. Music. Dancing. Laughter. I didn’t mind people shaving bits from me to enjoy with the other victuals on the table. Hours later, once people had left, I took stock of the damage. Just about half the brick I used to be, but they sure did have a good time. I looked to my left and right, and those odd-colored fellows had barely lost any of their questionable mass. Being popular does have its drawbacks. Still, I was not gone yet. Back into the drawer to chill. To think. Breathe. Sleep. Await my next entrance.</p><p>I’m not sure how much time had passed, but I awoke with a start. Yelling. No, screaming. Doors slamming. The darkness of my drawer was shattered by the sudden opening of my grander home, and I saw Chandler standing there, red-faced, contemplating the contents before him. He reached for me, pulling me out more aggressively than I’m used to being handled. He gesticulated wildly toward the other room, yelling all the while as I was aloft in his hand. Then with a sudden lurch and a sickening smack, I was thrown onto the table — not a cutting board or that blackboard slab — just the table. Maribel strode in from the other room, with Chandler continuing his tirade. As I shrugged off the fog from being mishandled, I tried to focus on what he was saying, but I couldn’t make out the words. They bled into each other like the colors of a brick of epoisses. I began to worry as their heated rhetoric became more so, and though I couldn’t understand the context, I longed for the darkness and solitude of my drawer.</p><p>Chandler grabbed a knife from the drawer. Where this instrument would normally be handled with deference before being used to carefully slice part of me, he brandished it in a way I’ve never seen. I was beginning to sweat on the counter. Had I been out for just a minute? Or ten? I didn’t have time to ponder this further as Chandler, having gripped the handle of the knife in his fist, punctuated his last slurry sentence by plunging the knife vertically through my heart. Maribel turned and left the room. A door slammed once more. Chandler muttered to himself and turned off the light, storming briskly to the other side of the house. And I was left there on the counter, mortally wounded, sweating.</p><p>Yes, I prefer the darkness of the drawer.</p>"
  },
  {
    "month": 3,
    "month_name": "March",
    "image": "candle.png",
    "image_alt": "Candle",
    "title": "Illumination",
    "abstract": "I had characterized my life as mostly linear until that day in September. The day I left. Daily routines abstracted to weekly routines; weekly routines abstracted to yearly routines. Linear. Would that seemingly endless train track of routine ever end, or curve, or branch?",
    "link": "https://medium.com/@scottpdawson/chapter-3-illumination-55f5c58cb340",
    "story": "<p>I had characterized my life as mostly linear until that day in September. The day I left. Daily routines abstracted to weekly routines; weekly routines abstracted to yearly routines. Linear. Would that seemingly endless train track of routine ever end, or curve, or branch? Would I know it if it did? The man I loved had become increasingly disrespectful and despicable, and like a frog being slowly heated in a pot of water, I didn’t notice, even when that water began to bubble and sputter. That September morning I did notice, though. It was as if a switch had been flipped inside me, and as I wordlessly packed a bag, I thought about how I’d explain it. Turns out I didn’t. I just walked out the door and never looked back.</p><p>I drove through the day with no particular direction in mind, grateful that our hybrid had the capacity to go far without stopping. The only real limiting factor I had to making progress in escaping the linear nature of my soon-to-be-prior life was the growing discomfort of my bladder. I did not listen to music. I did not cry. I did not call anyone. I just drove.</p><p>It was close to midnight and I was exhausted, so I pulled off an exit into a sleepy suburb of Denver. I’d always wanted to experience Colorado after the busyness of California, and it was as good a place to start over as any. I spent the next few weeks getting together some semblance of a new life. A new driver’s license, new apartment, and a decent job as a designer with a local web outfit. I made few friends, mostly through work. Emotionally I was still quite numb, not quite believing that my train had jumped those tracks and I was on quite a different track now. Did I like this? How far did this track stretch off toward the horizon?</p><p>As I walked the few blocks to work one morning, that emotional numbness evaporated as I passed a mother berating her child as they waited at a bus stop. I have never had children, but something maternal in me fired to life, and as I saw this woman almost abusing her child, and in public no less, I felt an urging to act. I was on her in an instant, peeling her cold grip away from her son’s shoulders, pinning her up against the poster-clad wall of the bus stop. My eyes met hers with an icy yet fiery gaze, and the words that came out of my mouth were not from my mind. “Do. Not. Do. That. Ever. Again.” I punctuated each word by pressing her body up harder against the wall. “Just don’t. Be nice.”</p><p>Just as quickly as I had engaged the mother, I was gone, walking briskly down the sidewalk. I passed one nondescript building after another, but then came to a block taken up by just one very ornate building, a Catholic church. I had not been to church since I was very little, but something pulled me in today. The heavy doors slowly shut behind me, dampening the sound of the outside world and leaving me standing alone in a great expanse of marble and wood, looking around at the patron saints on the outer walls and the weather pews longing for someone to sit in them. I walked directly over to the closest figurine. I wasn’t sure which saint it was, but I was sure that whatever it was, it would help me. I lit the closest candle to me, turned around, and sat in one of the weathered pews.</p><p>I closed my eyes and glanced skyward, hearing nothing but the silence of the vastness of the space. I thought of my candle and what I hoped it symbolized. Rebirth. Renewal. Hope. And I smiled.</p>"
  },
  {
    "month": 4,
    "month_name": "April",
    "image": "pasta.png",
    "image_alt": "Pasta",
    "title": "Pasta No More",
    "abstract": "There was a crispness in the air as I walked the last few blocks towards home after my bus left me off after work. I enjoyed the walk, breathing in the humidity in the air, a rarity for the area. This walk always afforded me time to think. ",
    "link": "https://medium.com/@scottpdawson/chapter-4-pasta-no-more-5456171d9794",
    "story": "<p>There was a crispness in the air as I walked the last few blocks towards home after my bus left me off after work. I enjoyed the walk, breathing in the humidity in the air, a rarity for the area. This walk always afforded me time to think. Thinking big and small, narrow and wide: about the rat race, about the choices I’d made in life, about what hit during the last 24-hour news cycle, and tactically about what to make for dinner. The pantry was mostly bare, which could mean another “run the gauntlet” trip to the store along with the rest of the 9–5 crowd. My modest home (which certainly didn’t cost a modest monthly mortgage payment, given our zip code) came into view. However, Maribel’s car was not in the driveway. She was rarely late, but she was surely not here yet.</p><p>“Hello?”</p><p>The house seemed cold and uninviting as I walked in. I turned on a few lights, dropped my bag by the door and made a quick circuit of the first floor, peering in each room.</p><p>“Mari? You here?”</p><p>Silence.</p><p>I opened the “Find my iPhone” app to see where she was. The last known location of her phone was the house, as of this morning, which was odd. I looked in our usual spot for charging our devices. Empty, as I suspected, except a smattering of iPod Shuffles that we used for running. I tried calling her, but no answer. I tried to shelve the worry and panic creeping up from somewhere deep in my body, and instead set about getting ready for the evening. I was sure she got held up somewhere, and maybe her phone gave up the ghost. Surely there was an explanation. Surely she’d be here soon.</p><p>I put on some random playlist to cut out the silence that pervaded our house. Vince Gill came on after a few tracks, singing …</p><blockquote><i>Oh the lonely sound of my voice calling<br />Is driving me insane<br />And just like rain the tears keep falling<br />But nobody answers when I call your name<br />Oh nobody answers when I call your name</i></blockquote><p>Enough music. I turned it off, savoring the silence once more. I investigated our refrigerator and pantry to see if there was something I could make for dinner. Everything was almost bare, but I could eke out the most standard of standby meals: pasta with meatballs. A few minutes of boiling water, some microwaved meatballs and a can of sauce. Dinner was ready, courtesy of Chef Stidwell. “Chef, my ass,” I muttered.</p><p>I peered out the front door at the empty street. My table for two was set, but where could Mari be? Worry and panic arrived in full force, and suddenly I had lost my appetite. I looked back at the table, a wave of nausea hitting me head on. I dumped the contents of our pasta bowls into the trash, leaving the dishes in the sink for another day. Wandering into our bedroom, I stood for many minutes, my skin feeling flushed and numb in places. I sat on the edge of the bed, laid back to stare up at the ceiling, and tried to breathe deeply.</p><p>I awoke in the pre-dawn hours when the birds began calling for the start of a new day. I was still dressed from the night before. Nobody shared my bed. I shuffled from the bedroom down the hall, past pictures of vacations and life’s milestones, and looked out the front door once more.</p><p>No car.</p><p>No Mari.</p><p>She was gone.</p>"
  },
  {
    "month": 5,
    "month_name": "May",
    "image": "coral.png",
    "image_alt": "Coral",
    "title": "School of Thought",
    "abstract": "When I started dating him, Chandler had amassed quite a resume of hobbies, none of them with a very long tenure. Like phases of life, he dove headfirst into one, and just when he seemed to be comfortable with it, he left it and immersed himself in another. ",
    "link": "https://medium.com/@scottpdawson/chapter-5-school-of-thought-a76138beb664",
    "story": "<p>When I started dating him, Chandler had amassed quite a resume of hobbies, none of them with a very long tenure. Like phases of life, he dove headfirst into one, and just when he seemed to be comfortable with it, he left it and immersed himself in another. I should have taken this as a warning sign of his “life gestalt”, but I didn’t.</p><p>There were the model trains he had in his basement on a custom-built landscape that took up well over the size of a pool table. He spent many afternoons telling me all about each engine and car — they were all HOn3-scale, don’t-you-know — and then he moved on to the landscaping pieces. I helped as I could, but my trees were never quite natural enough and my proposed track routes were always “not optimal”. But, he kept at it for months, until he abruptly covered HOn3-town with an old sheet and took up golf.</p><p>Several hundred dollars later, his car boot was filled with new clubs, bag, shoes, gloves and all sorts of smaller golf paraphernalia that I never knew existed. I was not at all interested in joining him in this latest passion, but he saw that as a plus: I could drive the cart. Which, I admit, was fun. He signed up for lessons with a pro, and proudly posted his improving scorecards on his refrigerator door. One weekend I was invited on a trip to a lush course several hours from home with some college girlfriends of mine, several of whom were good golfers. We had a blast, but when I came home and showed Chandler my scorecard, his face belied his words of pride in my accomplishment. That weekend, one of the few times I’ve played the sport, I beat every single one of his scores. Yep, he gave up golf the next week. Sold his clubs on craigslist.</p><p>In another unique twist, he took up the french horn. He came home from work one day with a rented horn from the local music shop, proudly played a few notes and proclaimed he was taking up the instrument once more after a long post-high school hiatus. I’m not sure how he played in high school, but “Chandler the French Horn Player, Version II” was not very good. Admittedly he’d lost his embouchure and would get (some of) it back, but it was taxing on the ears when he practiced. I encouraged him though, and after a few months he’d built up the confidence to audition for a brass group in town that was always looking for new players. He felt he’d auditioned well, but was dismayed to be placed in the lowest possible part, playing the same small collection of low-register notes in varying rhythms. He played with the group at a 4th of July bash, but after that the horn went back to the music shop and he went looking for another hobby.</p><p>Not long after, we stood in front of the largest tropical fish tank in the pet store around the corner from his apartment. Chandler was mesmerized by the array of fish in the tank, and I admit I was taken in by the plant life gently swirling in the artificial current, amid corals of the brightest … well … coral color. Hand on hip, he cocked his head to the side and said, “Yep, I can do this. We can put a tank like this in my living room.” I chuckled a bit and might have even scoffed.</p><p>Clearly offended, he said, “What?”</p><p>I continued, “Well, I think it’s a lot of work. Are you sure you’re up for the intensity and focus I’m sure this takes?”</p><p>“Are you saying I can’t focus?”</p><p>“No, all I’m saying is this takes daily care. Kind of like having kids.” I’m not sure why I’d said that, and I’m sure experienced parents would smack me for making the comparison, but I was trying to make a point. I continued, trying to dig myself out of a bit of a hole, “I know that when I have kids someday it’ll take a lot more effort than I think it’ll take.”</p><p>“Wait, kids? You want … kids?”</p><p>Damn. I really stepped into it. “You … don’t?”</p><p>“No, I don’t,” he said flatly.</p><p>His attention returned to the fish tank. I started chewing my fingernails, a nasty habit I relied on whenever I felt uneasy. I wandered a few aisles over to the bird cages, watching the colorful cockatiels and parrots flit from one end of their sanctuary to the other. They were mesmerizing, but they couldn’t distract me from what I felt was the biggest incompatibility between us, a disagreement about whether to have kids. Chandler’s voice broke me out of my trance. He was over at the cash register with a cart full of tropical fish essentials. He’d get his damn fish, I thought, and we’d see just how long they’d last before getting flushed. I gave ’em three months in my mind just then.</p><p>They lasted two.</p><p>Poor fish.</p>"
  },
  {
    "month": 6,
    "month_name": "June",
    "image": "boat.png",
    "image_alt": "Boat",
    "title": "Lila Jane",
    "abstract": "I was sixteen, and old enough to get a job, my Dad said. He was a fisherman, like his Dad before him, and so it was an obvious play for him to take me down to the docks and introduce me to some of his friends. ",
    "link": "https://medium.com/@scottpdawson/chapter-6-lila-jane-ae44d93ebc1c",
    "story": "<p>I was sixteen, and old enough to get a job, my Dad said. He was a fisherman, like his Dad before him, and so it was an obvious play for him to take me down to the docks and introduce me to some of his friends. We wouldn’t work the same boat, he said, since it was supposed to be an education for me, too. Having your Dad around, paradoxically, was not conducive to that type of education on a fishing boat.</p><p>So I found myself sailing off in the pre-dawn hours on the Lila Jane. We were underway for hours, it seemed, before we started casting nets. The skies, cloudy when we left under a full moon, had turned darker and more ominous. I was relieved to be working on the deck, since during our “commute” I felt I had received more of an education than I’d bargained for. The other crew, either forgetting my youth or not caring, engaged in conversations far above (or below, depending on your perspective) my pay grade, and I found myself either disgusted or inappropriately engrossed by the topics.</p><p>“Hey, Chandler,” one yelled in my direction. “Y’ever seen anything like that in your life?”, referring to one particularly disgusting encounter he’d relayed. Another chided him, “You kidding? This kid ain’t even been shavin’ yet, and you think he’s seen that?”</p><p>You can see why I was glad to have stopped talking and started working.</p><p>We busied ourselves with work, but the skies turned yet darker and the wind started to whip up. The captain told us to haul in the lines quickly (we’d almost finished putting them out), and we didn’t need any more motivation than that. Lighting lit up the darkened skies around us and the crash of waves against the hull complemented the rolls of thunder all around us. I felt a shiver of fear course through my body as my sense of self-preservation kicked in. I worked as quickly as I could, despite the stinging spray of salt water spraying from all directions. Soon our work was done, things were stowed away, and water began swamping the deck between the monstrous waves. I staggered through the door to the interior as if I were drunk, and collapsed into a heap in the darkened corner as the Lila Jane listed to and fro. The other crew retreated to their own spaces, laughing and chortling about something or other. I didn’t particularly care. Waves of emotion came over me, and in that moment, in the stomach-churning darkness, I cried like a baby.</p><p>The calmness after the storm passed led us to resume our work, casting nets, hauling them in, packing the fish into the rooms filled with ice. It was backbreaking work. I thought it would never end. When it did, I vowed to never again set foot on a fishing boat, and I was true to my word. Back on land, months later, you’d find me working the checkout lanes at the grocery store. Never again, I said, would I do something that made me feel that exposed and vulnerable.</p><p>Never again.</p>"
  },
  {
    "month": 7,
    "month_name": "July",
    "image": "picnic.png",
    "image_alt": "Picnic",
    "title": "The Picnic",
    "abstract": "It’s not easy being a bug.<br /><br />Well, an ant, to precise. Humans seldom pay any attention to us, unless we’re encroaching on their personal space, or more importantly, their food. This is why me and my friends absolutely adore the summer concerts on the great lawn. ",
    "link": "https://medium.com/@scottpdawson/chapter-7-the-picnic-c2ca37cdf97d",
    "story": "<p>It’s not easy being a bug.</p><p>Well, an ant, to precise. Humans seldom pay any attention to us, unless we’re encroaching on their personal space, or more importantly, their food. This is why me and my friends absolutely adore the summer concerts on the great lawn. Every week, we’re pretty much guaranteed a front-row seat for a cornucopia of goodness that sometimes we appreciate even more than the humans! No longer content to skim off the random candy wrapper or half-eaten ice cream cone discarded by toddlers in our midst, on these evenings we clean up our mandibles and feast like kings and queens.</p><p>My buddies Flanders and Gunther joined me on the far edge of the lawn, a bit in the shade, but a spot where we’d scored big in the past. Humans typically set out their spreads and are then mightily distracted by the music off in the distance. This leaves us in a pretty good spot, having full run of the place ’til one of their pudgy fingers reaches down and invariably sees one of us going for the very item they’d like at that moment. I felt that we’d be particularly lucky tonight, as it was a really good band. I spied a dark red plaid blanket in the distance, and as we approached, I felt a flutter in my thorax. A bowl of grapes, cheese, crackers and a bottle of wine. These folks would be here for awhile, and they were clearly a classy bunch. It was a nice brick of cheese, the kind with holes. Gunther suggested we lie in wait just below a fold of the blanket, and Flanders (the most expert forager among us) agreed wholeheartedly. Once the music struck up, he said, we’d emerge from our fold and gorge ourselves.</p><p>A few moments later, after quasi-witty banter from the master of ceremonies and the beginning of the music, we sprung into action. I started in on an edge of a deliciously salty cracker while the other boys tried to make a dent in the cheese. We had to keep our antennas sharp, always on the lookout for those pudgy fingers. However, none came. More moments went by, and we were increasingly aware of the fact that the food had been untouched by human hands. I gestured to the cheese-eaters to head over and huddle; I had a weird feeling that something was awry. We gathered at the edge of the plate and glanced skyward.</p><p>The humans were not listening to the music. One was gesticulating wildly to the other, and the tone of their voices was not jovial, not friendly. They took turns speaking to (well, at) each other. It was a man and a woman, and though I couldn’t make out the subtext of what they were saying, they punctuated their speech by pointing their fingers at each other, shrugging their shoulders and folding their arms, staring off into the trees before picking up the conversation again. They clearly weren’t hungry. Maybe we’d picked the wrong blanket, I thought to myself. Maybe we would be wise to pack up and wander off to another place. I sensed danger. I hate unpredictable people.</p><p>It was at that moment that Flanders shoved me off the edge of the plate, just before a huge drop of rain smashed into the spot where I’d been sitting. He and Gunther came down to see if I was okay, and we all agreed it’d been a close call. We glanced skyward again, not remembering that rain was in the forecast. However, the cloudless sky told us that it wasn’t rain. If not rain, what? I looked at the woman’s face and saw a tear rolling down from her eye. It rolled in a succession of other tears down her cheek, and with nowhere else to go, fell directly down onto the plate again.</p><p>She was crying, for sure, and the man was looking away. I wondered what it was all about?</p><p>My moment of concern didn’t last for long, though. The band started playing another song, and the couple was speechless, yet the tears kept on falling.</p><p>All I wanted to do was get back to that cracker.</p>"
  },
  {
    "month": 8,
    "month_name": "August",
    "image": "school_bus.png",
    "image_alt": "School Bus",
    "title": "Maternal Me",
    "abstract": "Winter in Denver was far more fun than I expected. I enjoyed my job and the creative outlet it afforded, yet I truly lived for the weekends. When I could, which was often, I’d shuttle to one of the nearby mountains with throngs of like-minded snowboarders and skiers. ",
    "link": "https://medium.com/@scottpdawson/maternal-me-a827ebbde1ed",
    "story": "<p>Winter in Denver was far more fun than I expected. I enjoyed my job and the creative outlet it afforded, yet I truly lived for the weekends. When I could, which was often, I’d shuttle to one of the nearby mountains with throngs of like-minded snowboarders and skiers. I quickly learned that the only thing better than a day in the mountains was two days in the mountains. For a few weekends, I had the luxury of crashing in some friends’ townhouses closer to the action in their respective ski towns. Teeming with people, the après scene in these places was spectacular and, if I could afford it, I’d partake each and every night of the week. I made a string of new friends during my evenings, and rarely paid for my own drinks. The memories of Chandler were dulling, and I was happy to be on my own, finally.</p><p>There’s that damned saying, though, that “all good things must come to an end.” It came with the change in seasons: good thing, ended. The snow banks receded, the trees started budding in anticipation of warmer weather, and I searched in vain for a new routine that would replace the wintertime high I’d get each weekend I went into the mountains. Sure, there’s hiking to be had, but one doesn’t simply get snowboarding’s accompanying adrenaline rush by walking in the woods. As I sat in front of the window of my apartment before heading off to work, I wondered what was missing. I began to sense that I wasn’t missing the thrill and escape. I feared it was something far more fundamental. Finding a new hobby or sport wasn’t going to cut it.</p><p>I glanced down at the warm cup of tea in cupped in my hands, as if pouring a hot drink could convince the weather gods to bring winter back. A sudden noise from the street broke me from my trance and I looked up. It was the school bus picking up the neighbors’ kids, who were all huddled together, excitedly waiting to get on board. A few parents were waiting off to the side, talking with each other, but as their kids got on the bus, they stopped their socializing long enough to watch each of their children walking from the front of the bus deeper towards the back, searching for a seat. One girl got on the bus, paused, then abruptly stepped back onto the curb. She raced back into her Dad’s arms, hugged him tightly for just a moment, then turned back and boarded the bus.</p><p>My breath caught for just a moment as a wellspring of emotion washed over me. That was it. I didn’t need a never ending winter sports season, and I didn’t need another party. I needed a child. My child. I had never had the opportunity to get very far in that quest with Chandler by my side, since he’d made it very clear early on that he was not interested in having children. I was. This was my time, and I wasn’t getting any younger. Yes, I wanted to love someone again, but mostly I wanted to hold my child in my arms, and help shepherd them through this thing called life.</p><p>I put my drink down next to me and touched my palms to my cheeks. I breathed out slowly, deliberately. The “maternal me” thought of what I could do next, now that I knew where I wanted to go.</p><p>A child.</p>"
  },
  {
    "month": 9,
    "month_name": "September",
    "image": "heart.png",
    "image_alt": "Heart",
    "title": "Awakening",
    "abstract": "Meteorological spring not only brought forth buds on the trees, but also an awakening in my soul. The epiphany I had while staring out the window at the neighborhood kids boarding the school bus was not the only revelation I’d had as the snow melted. ",
    "link": "https://medium.com/@scottpdawson/chapter-9-awakening-b736e0482969",
    "story": "<p>Meteorological spring not only brought forth buds on the trees, but also an awakening in my soul. The epiphany I had while staring out the window at the neighborhood kids boarding the school bus was not the only revelation I’d had as the snow melted.</p><p>I joined a local running group, meeting some really great people who had come from all walks of life. I took up yoga, albeit alone at home, since I was a bit too self-conscious of my inability to get into most poses. I started to meditate daily, first for a few minutes, and then stretches of a half hour or more immediately after waking up. I cut out eating crap whenever I was stressed, opting instead for a handful of almonds or glass of water whenever my stomach grumbled between meals. Oh, and I started getting some body work. No, not botox or collagen injections; I made a commitment to get regular massages and acupuncture.</p><p>If you’re judging the changes in my routine as selfish, you’d be correct, but I’d say you’re using the wrong word. By taking care of myself first, I would be the healthiest and happiest I could be, and bring that light into the world around me. In addition to my yearning to be a mother, this focus on self-worth and self-care was revealing. I saw it as an avenue to overall happiness. No longer was my life on auto-pilot. I had flipped that switch, grabbed the yoke of the aircraft that was my life, and steered in the direction I wanted to go. This intention, I was sure, would propel me into what would be the happiest part of my life.</p><p>After a month of my new routine, I felt confident enough to join a smaller set of women from my running group in their weekly yoga class. It was here that fate smiled on me. We were enjoyed a post-yoga coffee when we started talking about men. I listened tentatively, not sure if I wanted to share. I found myself wanting to erase Chandler fully from my awareness, since he popped up at times like this. Then I noticed that the maternal instincts in me yearned to share with my new friends my desire to have a child. So, I did. They listened carefully to my story, from which I omitted little. I talked about wanting a child. I talked about not wanting to take another risk on a guy, not just yet. I talked about how these ideas were quite at odds with each other. And then the woman to my right, Alice, softly touched my forearm and suggested, “Have you thought about adopting a child?”</p><p>Adoption? No, I had not considered that.</p><p>“You see,” she continued, “I own a adoption agency.”</p><p>I bowed my head and closed my eyes, thinking about the turns I’d taken in my life. I saw my future laid out before me, and that future had a child in it. I glanced toward her, and I saw in her eyes that she saw my eyes, and what was behind the welling tears. We made a commitment to meet that very week, to get started with learning more about the process.</p><p>Yes, there has been an awakening in my soul. My heart, my very core, is alight with the fire of someone who knows where they’re going, and is very much at the helm.</p>"
  },
  {
    "month": 10,
    "month_name": "October",
    "image": "music.png",
    "image_alt": "Music",
    "title": "Samuel",
    "abstract": "My name is Samuel.<br /><br />I’m 7 years old.<br /><br />My eyes are brown, and my hair is brown, and I don’t care much for peas.<br /><br />I bite my nails when I’m nervous.<br /><br />And I’m shy.",
    "link": "https://medium.com/@scottpdawson/chapter-10-samuel-5b3134f342b9",
    "story": "<p>My name is Samuel.</p><p>I’m 7 years old.</p><p>My eyes are brown, and my hair is brown, and I don’t care much for peas.</p><p>I bite my nails when I’m nervous.</p><p>And I’m shy.</p><p>It’s all right there on the form the the people read when they come in to see if they want any of us to come live with them. There are other things on the form, too, like that my Mom was someone who was living on the streets. Her name was Sally-something. When I was born, she didn’t want me. Not that I would have wanted her; the streets are no place to raise a baby. So here I was, with about twenty other kids who have similarly sad stories to tell.</p><p>My days are all the same. Not unhappy, mind you, but the same. The brightest light in my day is not when the sunlight streams in through the window by my bed, casting repeating parallelograms on the patterned tile floor. Music is my bright light. The piano.</p><p>I can play it for an hour a day, they say. Nobody else really likes to play, so I don’t know why they limit my time. I love the feeling when I sit to play, pulling the bench up to the keys and starting with a simple melody.</p><p>The symphony that’s always in my head pops into a third dimension, and I lose myself in the notes. First slowly, just the right hand. Then adding the left hand. I taught myself how to play using some of the tattered books hidden inside the piano bench. I go note by note, page by page, book by book. Then, all too soon, the hour is up and Betsy tells me to go outside and play. Betsy is always telling me to go outside and play.</p><p>This day, though, Betsy did not tell me to go outside and play. Betsy took my hand and sat me at the table. The other kids were outside playing. The sunshine was making shapes on the floor again, and the table was covered with crayons and empty juice glasses. Betsy looked at me and smiled, and took me by the hands. “Samuel,” she said. “I have good news.”</p><p>“We have found a home for you.”</p><p>The noise of the kids playing outside went silent. My legs went numb. Colors became so bright, and I began to cry. It was a happy cry. After Betsy had finished her talking, I asked her if I could go play the piano again. She said yes. I ran back over to the bench, sat down quickly and placed my tiny fingers on the keys. I didn’t get my music out. My heart, beating faster than normal, was full. I started to play a melody I had not heard before, that I’d not thought of before, and it was beautiful to me. The notes were leaping directly from my heart through my fingers.</p><p>I was going to be home soon.</p>"
  },
  {
    "month": 11,
    "month_name": "November",
    "image": "voting.png",
    "image_alt": "Voting",
    "title": "The Big Vote",
    "abstract": "Samuel had come home with me on a rainy afternoon in June. Thus began the most joyful summer of my life. It was filled with carousel rides, walks in the woods, playing at the spray ground to beat the summer heat and generally having the most fun we could have with each day.",
    "link": "https://medium.com/@scottpdawson/chapter-11-the-big-vote-8ddfb1fe5913",
    "story": "<p>Samuel had come home with me on a rainy afternoon in June. Thus began the most joyful summer of my life. It was filled with carousel rides, walks in the woods, playing at the spray ground to beat the summer heat and generally having the most fun we could have with each day. I ate more ice cream than any adult should, yet I felt barely a pang of guilt. I felt as if my life were complete, and many days brought pure joy.</p><p>I never dreamed that having a child in my life would be so transformative, yet it was. I saw my life only in forward motion, as if I were driving along without a rear view mirror to look into. Chandler, and all that was in my “prior” life, was not accessible to my daily thoughts. The carefree, joyous feelings I had as a single parent of a delightful boy continued to drive me happily through each day.</p><p>However, it didn’t last.</p><p>As the days turned shorter and the weather cooler, I began to get caught up in the national drama as the Presidential campaigning process unfolded. Usually one to avoid the fray of politics and religion, I got sucked into the debate. Several of my friends seemed my political polar opposite, and I found it difficult to see them through the same lens after a few heated discussions. The national conversation was also taking the same vitriolic turn. People who used to get along with each other were suddenly warring factions. I was afraid.</p><p>In prior elections, I remember feeling hope as I made my decisions about who to vote for. Hope for positive change, hope that trajectories that brought me pride in our country would not sharply jag in other directions. This time around, though, the world was different. Internationally things were in turmoil, with conflict escalating in the Middle East, sabre-rattling from Russia, the widening chasm between the rich and the poor, gun violence at home, and terrorism running amok in Europe and beyond. Couple that with the sensational things being slung between our Presidential contenders, and my feelings of fear were quite warranted.</p><p>The debates brought me no relief from these fears. The one-liners and pessimistic undertones had me retreating to my Twitter feed, looking for solace in the comic commentary of like-minded friends. This was not supposed to be entertainment, and it was sad that most of who I knew were tuning in as if it were a sporting event of national interest, not a battle of wits and intellect that would determine the leader of our country for the next four years.</p><p>So it was that I found myself heading to my local polling place on the morning of Election Day. I got there early, and in my mind’s eye, I saw two queues forming. Bad Hombres to the right, Nasty Women to the left. Which line would I go into? If you came between my son and me, or did anything to upset my status quo, I’d be one bad hombre in short order. That said, I was also quite a nasty woman, by the re-definition of that term during the debates.</p><p>I marched right through the middle of the doorways of the polling place. I cast my vote. I went home, crying most of the way, knowing that either way we were in trouble. I decided I wouldn’t go to work that day. I stopped by Samuel’s school on the way home and retrieved my son. I made up some excuse about a doctor’s appointment. I hugged Samuel tightly, probably a little too long. As I stood back and looked at his questioning face, I told him, “We’re going to have a day off, just you and me. And we’re going to have a lot of fun.”</p><p>Our first stop? Ice cream for two.</p>"
  },
  {
    "month": 12,
    "month_name": "December",
    "image": "ski_dreams.png",
    "image_alt": "Ski Dreams",
    "title": "Sweet Dreams",
    "abstract": "It was now the winter of my first year with Samuel. He had adjusted so well to life with me in Denver. He had a small cadre of friends he’d made during his first week of school. He, like many of the other kids, was unfazed by the dramatically shifting political climate. ",
    "link": "https://medium.com/@scottpdawson/chapter-12-winter-bliss-cd3383fb484",
    "story": "<p>It was now the winter of my first year with Samuel. He had adjusted so well to life with me in Denver. He had a small cadre of friends he’d made during his first week of school. He, like many of the other kids, was unfazed by the dramatically shifting political climate. I was not so fortunate. I put on my best game face for Samuel, but there were some days where I felt like climbing back into bed after I put him on the bus.</p><p>I’ve heard that planning a vacation provides you with the lion’s share of the pleasure of that vacation. Ah, anticipation is a wonderful thing. I had therefore booked a ski vacation for me and Samuel. It was a short drive from Denver to Loveland Ski Area, and the name had practically done the sales job for me. I thought we could all use a little love in our land. Lodging was not too far away and sounded like just the right amount of “rustic.” The mountain also offered lessons for his age group.</p><p>So it was that we found ourselves driving West on I-70 on a Friday afternoon shortly after he was dismissed from school. It was just an hour drive to our accommodations, but the busy Colorado ski traffic had us getting there shortly after 5:30. We pulled into the bed and breakfast’s small driveway and carried our bags onto the expansive porch. The porch was littered with all of the signs of ski town life: skis, snowboards, a pair of snowshoes and plenty of seating for hanging out. I carefully opened the door and ushered Samuel into the foyer. The proprietor, a grizzled but gentle man, introduced himself as Jake. He’d owned the place for 15 years, having fallen in love with the mountains many years ago. His smile seemed to foretell the fun I’d have with my son in the coming days.</p><p>We headed up a narrow staircase to our cozy room. There was a small twin bed for Samuel and a very comfortable queen-sized bed for me. The room was wonderfully outfitted with ski town kitsch that made me instantly feel right at home. We bid good night to Jake, who had finished walking us through the features and quirks of the room and adjoining bathroom. Samuel and I both agreed that we were quite hungry after our drive, so we dove straight into the grocery bags I’d brought.</p><p>Our carpet picnic was incredibly delicious. The right amount of cheese, crackers, sausage and sliced peppers complemented some homemade hummus I’d made a few days prior. I was happy that Samuel had quickly adapted to my whole-foods approach to eating. He sipped his lemon-flavored San Pellegrino (his infrequent indulgence) happily as I nursed a glass of Pinot Noir. He was content. I was content. We were in a fabulous room just miles away from new outdoor experience for us. We wrapped up our carpet picnic as our stomachs told us that we were sated. I brushed my teeth alongside Samuel, said our prayers together, and tucked him into the twin bed.</p><p>As I sat reading by the soft light beside my bed, I couldn’t help but smile. My life before this one began its decline on a ski slope when Chandler had his accident. At the bottom of that decline, it was so dark as I struggled to find my way. Slowly, yet steadily, I’d climbed out of that darkness and found a far brighter, happier place. On my own, but not alone. The irony was not lost on me: the end of one story and the beginning of another both had a wintry slope as the backdrop.</p><p>Tomorrow was going to be a fabulous day. I knew it in my heart. “Sweet dreams,” I said aloud. Sweet dreams, indeed.</p>"
  }
]
