{
    "hmTraining": [
        {
            "date": "2020-09-07",
            "type": "Ride",
            "title": "Group Ride to Sheldrake",
            "miles": 32.31,
            "minutes": 142,
            "strava": 4026995299,
            "description": "Labor Day. Amy and I joined a group ride from the Farmer’s Market, heading to Sheldrake and back on country roads. We were rushed getting there after a failed attempt to lunch at Viva (they were closed), so I wolfed a slice of pizza as we rode to meet the group."
        },{
            "date": "2020-09-08",
            "type": "Run",
            "title": "Track Repeats",
            "miles": 6.62,
            "minutes": 53,
            "strava": 4029927425,
            "description": "12 x 400 w/ 90s RI. First day of the 16-week plan. Happily headed to the HS track, but stymied by the group of girls walking around it. Obviously, some kind of team practice was messing with my plan. Still, heading to the streets for these repeats got the job done. This felt really tough, but doable."
        },{
            "date": "2020-09-09",
            "type": "Weight",
            "title": "BodyPump 113 Express",
            "miles": 0,
            "minutes": 41,
            "strava": 4037192275,
            "description": "Tough release with impossible choreography for the lunge track."
        },{
            "date": "2020-09-10",
            "type": "Run",
            "title": "Tempo Run",
            "miles": 6.04,
            "minutes": 43,
            "strava": 4039214540,
            "description": "2 mi easy, 3 mi @ ST (6:21 goal), 1 mi easy. Hit 6:18, 6:28 and 6:11 for the fast miles. Yeah!"
        },{
            "date": "2020-09-11",
            "type": "Combat",
            "title": "BodyCombat",
            "miles": 0,
            "minutes": 52,
            "strava": 4043927867,
            "description": "Release #76 has some really great combinations in it! I listed the releases I’ve done before so I won’t be repeating anytime soon. There’s a ton of ‘em on demand."
        },{
            "date": "2020-09-12",
            "type": "Run",
            "title": "Long Run",
            "miles": 8.04,
            "minutes": 54,
            "strava": 4048787464,
            "description": "Long run day called for 7-minute miles. It was nice and cool out in the morning, so I hit the pace a little hard in the beginning and just held on! Ended up with a 6:45 overall with pretty even splits."
        },{
            "date": "2020-09-13",
            "type": "Ride",
            "title": "Choose Your Own Adventure",
            "miles": 15.35,
            "minutes": 57,
            "strava": 4053999428,
            "description": "Calves felt really tight after this week's runs, so I really looked forward to getting this bike ride done for therapeutic reasons. It was a nice stretch of the legs and nice cool temperatures for a ride."
        },{
            "date": "2020-09-13",
            "type": "Weight",
            "title": "BodyPump with Chantelle",
            "miles": 0,
            "minutes": 55,
            "strava": 4055911554,
            "description": "I love the mixes that Chantelle puts together. Virtual with a live instructor is bested only by the energy of a live class!"
        },{
            "date": "2020-09-13",
            "type": "Wrap",
            "description": "It was a delightful week of fitness, but carried with it the stresses and preparation for back-to-school. Soon we'll be into our new-new-normal as our routines adjust, yet again. I'm feeling good physically, though, so bring on Week 2."
        },{
            "date": "2020-09-15",
            "type": "Run",
            "title": "Track Repeats",
            "miles": 7.55,
            "minutes": 55,
            "strava": 4062846888,
            "description": "400, 600, 800, 1200, 800, 600, 400. I guess it's not hard to have the track to yourself when you get there early and the morning temperatures are hovering around 40°. This was really challenging (oof, that 1200), yet fun! Managed to keep within the goal of each segment by under 10 seconds, so #winning in my book."
        },{
            "date": "2020-09-16",
            "type": "Weight",
            "title": "BodyPump 104 Express",
            "miles": 0,
            "minutes": 25,
            "strava": 4070941206,
            "description": "This was hands-down the shittiest day of work I've had in a while. Not a lot to show for my efforts, and evening motivation was waning. But ... Amy and I spurred each other on to at least do a half-hour edition of our fav BodyPump release."
        },{
            "date": "2020-09-17",
            "type": "Run",
            "title": "Tempo Run",
            "miles": 7.04,
            "minutes": 48,
            "strava": 4072851437,
            "description": "5 miles of tempo with target pace of 6:36. Hit 6:30, 6:30, 6:30, 6:26, 6:27. Yesterday's stresses evaporated after this, and I enjoyed listening to the soundtrack to The Greatest Showman."
        },{
            "date": "2020-09-18",
            "type": "Combat",
            "title": "BodyCombat 77",
            "miles": 0,
            "minutes": 46,
            "strava": 4079832977,
            "description": "This was a really great session that dovetailed nicely into my early afternoon. I made a list of the Combat classes I've taken so far on Les Mills on Demand so I won't repeat myself.5 more uniques to go!"
        },{
            "date": "2020-09-19",
            "type": "Run",
            "title": "Long Run",
            "miles": 9.05,
            "minutes": 61,
            "strava": 4083765119,
            "description": "Crisp. Sunny. Beautiful. And no GPS data because (of course) my Apple Watch got messed up after Apple's latest update. I fixed it later in the day by re-pairing it with my phone, but missed out on capturing my route nonetheless. All 9 miles sub-7, per plan, out-and-back on Congress and then out-and-back on Rabbit."
        },{
            "date": "2020-09-20",
            "type": "Ride",
            "title": "Sunday Ride with Art",
            "miles": 24.51,
            "minutes": 86,
            "strava": 4088736510,
            "description": "Enjoyed this ride with Art! Man, Perry City is a sweet westbound stretch. Had a great workout with great conversation!"
        },{
            "date": "2020-09-20",
            "type": "Weight",
            "title": "BodyPump 109 Express",
            "miles": 0,
            "minutes": 46,
            "strava": 4089977898,
            "description": "After this morning's ride and this afternoon's yard work, I was not feeling up to this. It's just 45 minutes, though ... how bad can it be? Well, the Express releases pack a punch, so I got punched. Happy tomorrow's a rest day!"
        },{
            "date": "2020-09-20",
            "type": "Wrap",
            "description": "I thought the repeats were the least enjoyable workout of the week. I phrase it that way because I actually enjoyed all of the running workouts. Perhaps that's a side benefit of a plan that has fewer weekly miles? I also appreciate all the cross training I am getting in. Now that the week is closing down, I do feel that my body is calling for a rest day. Oh, look, that's on the plan for tomorrow!"
        },{
            "date": "2020-09-22",
            "type": "Run",
            "title": "Track Repeats",
            "miles": 6,
            "minutes": 45,
            "strava": 4096311818,
            "description": "6x800 with 90s RI. The fairgrounds track is a half-mile, so this was perfect on this chilly morning!"
        },{
            "date": "2020-09-23",
            "type": "Combat",
            "title": "BodyCombat 74",
            "miles": 0,
            "minutes": 50,
            "strava": 4104004995,
            "description": "Planning on Friday night BodyPump at the FLX Annex, so traded BodyCombat into this Wednesday slot. There's nothing nicer than Combat on the deck!"
        },{
            "date": "2020-09-24",
            "type": "Run",
            "title": "Taughannock Tempo",
            "miles": 6.08,
            "minutes": 45,
            "strava": 4105808124,
            "description": "There are always some GPS anomalies in the park, but the weather was too good to pass up some speed on the base trail. Tempo miles called for 6:21, and I hit 6:41, 6:20, and 6:26. Considering the variable terrain and the marina stairs, I'm pretty happy with this!"
        },{
            "date": "2020-09-25",
            "type": "Weight",
            "title": "FLX Fitclub BodyPump with Chantelle",
            "miles": 0,
            "minutes": 59,
            "strava": 4112014373,
            "description": "Friday night BodyPump was one of our pre-pandemic staples. When Chantelle offered an outdoor edition in that time slot, we jumped right on it. Front row, all smiles, sun at our backs ... it was a great workout!"
        },{
            "date": "2020-09-26",
            "type": "Run",
            "title": "Long Run (Leaf Peeping)",
            "miles": 10.02,
            "minutes": 80,
            "strava": 4114591336,
            "description": "A run with no pace goal means leaf peeping! Beautiful trees and a pause to say hello to The Bialke family’s horses."
        },{
            "date": "2020-09-27",
            "type": "Ride",
            "title": "Sheldrake Ride with Art and Herman",
            "miles": 34.11,
            "minutes": 138,
            "strava": 4121290987,
            "description": "Art invited me out for a long ride on one of the last warm days we may have. Temperatures turn cooler early this week, so it was nice to get out for this ride and meet Herman, too!"
        },{
            "date": "2020-09-27",
            "type": "Wrap",
            "description": "I really felt tired after today's ride. So much so that I took a nap! I know I didn't hydrate enough on the ride, and didn't take any nutrition during, either. So, not smart. The running this week has me ready for more, though, so am looking forward to an early start tomorrow. Will do my repeats on Monday due to Tuesday's forecasted rain!"
        },{
            "date": "2020-09-28",
            "type": "Run",
            "title": "Track Repeats",
            "miles": 7.38,
            "minutes": 54,
            "strava": 4123524361,
            "description": "Man, this felt really hard on tired legs from yesterday’s ride! 5x1000 on the high school track. Delightful to get this done as the sun rose!"
        },{
            "date": "2020-09-29",
            "type": "Weight",
            "title": "BodyPump 113",
            "miles": 0,
            "minutes": 50,
            "strava": 4130662724,
            "description": "Les Mills On Demand always churns out a good workout. We opted for a full-length edition to nail our biceps and triceps."
        },{
            "date": "2020-09-30",
            "type": "Run",
            "title": "Tempo",
            "miles": 5.27,
            "minutes": 37,
            "strava": 4132482412,
            "description": "3 miles of work at short tempo pace (6:21) so ... mission accomplished. Cool, but humid. Kind of hard to shake off the disgust from last night's presidential debate. I think I'd need all day to do that."
        },{
            "date": "2020-10-01",
            "type": "Combat",
            "title": "BodyCombat 73",
            "miles": 0,
            "minutes": 55,
            "strava": 4139308731,
            "description": "This was a pretty good release. Planned to do it on the deck, but with slippery boards I opted for inside."
        },{
            "date": "2020-10-02",
            "type": "Weight",
            "title": "BodyPump 97",
            "miles": 0,
            "minutes": 61,
            "strava": 4145769761,
            "description": "97 is hands-down my favorite on-demand track. It's like putting on a nice, comfortable pair of shoes. And then sweating a lot."
        },{
            "date": "2020-10-03",
            "type": "Run",
            "title": "Delightful and Short",
            "miles": 9.03,
            "minutes": 61,
            "strava": 4145770296,
            "description": "My post-run latte has never tasted so good. Crisp air and sunny skies made this run really fun, and it ended before I got tired of it. I like this distance!"
        },{
            "date": "2020-10-04",
            "type": "Ride",
            "title": "Indoor Cat",
            "miles": 0,
            "minutes": 60,
            "strava": 4152129052,
            "description": "Felt like a little indoor steady state riding today. I'm grateful we have a Keiser bike! Sweated quite a bit AND got to watch a movie!"
        },{
            "date": "2020-10-04",
            "type": "Wrap",
            "description": "Wow, what a dreary day! It's okay, because we need dreary days to remind us how wonderful sunny days are. This week has been taxing physically and emotionally, but with good nutrition and rest, I'm ready for plenty of fun next week. Bring it."
        },{
            "date": "2020-10-05",
            "type": "Weight",
            "title": "BodyPump 105",
            "miles": 0,
            "minutes": 43,
            "strava": 4156694879,
            "description": "Post-work BodyPump, express edition. The short class is tough, but getting started so close to dinner had us not feeling up to the full hour. Good enough!"
        },{
            "date": "2020-10-06",
            "type": "Run",
            "title": "Mile Repeats",
            "miles": 5.04,
            "minutes": 34,
            "strava": 4123524361,
            "description": "3x1600 w/ 60s RI. Goal pace of 5:48, so I wasn’t far off with a 5:51, 5:53, and 5:59. My intervals always seem to be marginally slower than the plan calls for, but the tempo and long runs are right on the money."
        },{
            "date": "2020-10-07",
            "type": "Combat",
            "title": "BodyCombat 72",
            "miles": 0,
            "minutes": 55,
            "strava": 4164932692,
            "description": "Strava says this workout was 90 minutes, but only because I had to pause my watch to take a call. Funny to mess up the time so much just for the sake of my abs."
        },{
            "date": "2020-10-08",
            "type": "Run",
            "title": "Tempo",
            "miles": 8.06,
            "minutes": 55,
            "strava": 4167437626,
            "description": "6 miles at long tempo pace, target 6:51. What a delightful temperature for this hard effort!"
        },{
            "date": "2020-10-10",
            "type": "Run",
            "title": "#LGR Long Run",
            "miles": 11.1,
            "minutes": 77,
            "strava": 4176284349,
            "description": "Red tree, shirt, Altra shoes, and Cornell scarf (Lynah, how I miss you). Took today’s long run and made it 100% Big Red for Cornell Homecoming."
        },{
            "date": "2020-10-11",
            "type": "Ride",
            "title": "Brisk Yet Beautiful",
            "miles": 17.54,
            "minutes": 66,
            "strava": 4182763871,
            "description": "It was a beautifully sunny day. As I got going on my ride, I regretted not having at least some lightweight gloves. That only motivated me to keep focusing on turnover on this ride's ups and downs."
        },{
            "date": "2020-10-11",
            "type": "Weight",
            "title": "BodyPump with Chantelle",
            "miles": 0,
            "minutes": 55,
            "strava": 4183224211,
            "description": "Watched the replay of Chantelle's Saturday morning FLX Fitclub BodyPump class. I love doing this class in my living room ... but I do miss our Friday Happy Hour Pump in the studio, too."
        },{
            "date": "2020-10-11",
            "type": "Wrap",
            "description": "The vibrant leaf coloring from last week is replaced by a pretty consistent browning and shriveling. We've been without much water these last few months, so that's affecting my leaf peeping! It was a good, solid week of fitness, and I particularly enjoyed my Thursday tempo and my solo hike on Friday."
        },{
            "date": "2020-10-12",
            "type": "Run",
            "title": "J.P. Morgan Corporate Challenge",
            "miles": 5.17,
            "minutes": 37,
            "strava": 4185136358,
            "description": "Tomorrow's forecasted rain had me wanting to do my track repeat workout today. I also coincidentally signed up for the J.P. Morgan Corporate Challenge, a 3.5 mile effort. So, I combined the concepts today! The challenge has its own app to use, and I covered 3.5 miles in 22:17, with splits of 6:17, 6:23, 6:32, and 6:10. Pretty happy with that!"
        },{
            "date": "2020-10-14",
            "type": "Weight",
            "title": "BodyPump 105",
            "miles": 0,
            "minutes": 43,
            "strava": 4199042276,
            "description": "We liked the the LesMills On Demand BodyPump 105 Express release so much last week that we repeated it this week. Smooth, efficient, powerful."
        },{
            "date": "2020-10-15",
            "type": "Run",
            "title": "Double Tempo",
            "miles": 7.01,
            "minutes": 50,
            "strava": 4199042934,
            "description": "This was a fun one. A tempo with a mile break in the action. I headed out at 7 a.m. and enjoyed seeing the brilliant sunrise as I ran the warmup mile. The work was tough, but I hit the goals and made it back to my house in time to get cleaned up for work!"
        },{
            "date": "2020-10-16",
            "type": "Combat",
            "title": "BodyCombat 71",
            "miles": 0,
            "minutes": 43,
            "strava": 4208203474,
            "description": "Well, they don’t offer an express version of this release, but given the time constraints, I made my own. Just skipped a few tracks ..."
        },{
            "date": "2020-10-17",
            "type": "Run",
            "title": "Rambling in the Sun",
            "miles": 10.21,
            "minutes": 70,
            "strava": 4208203796,
            "description": "Oof, that was hard. I am used to running in the morning, before I eat anything, so this post-lunch run felt kind of tough. It is beautifully sunny, though."
        },{
            "date": "2020-10-18",
            "type": "Weight",
            "title": "BodyPump with Lynn",
            "miles": 0,
            "minutes": 54,
            "strava": 4213976352,
            "description": "A delightful virtual class with Lynn. There's something wonderful about working out in your living room when it's *not* your dinner night."
        },{
            "date": "2020-10-18",
            "type": "Wrap",
            "description": "I can't believe it's already mid-October. Where is the time going? My wife and I agree: time seems like it's moving both slowly and quickly, inexplicably at the same time. Regardless, that's another week of successful fitness, and I'm looking forward to the week ahead!"
        },{
            "date": "2020-10-20",
            "type": "Run",
            "title": "Midday Misty Intervals",
            "miles": 5.73,
            "minutes": 43,
            "strava": 4221088481,
            "description": "Got to a logical stopping point at work and laced up for 6x800 w/ 90s RI. Tough, short, and delightful."
        },{
            "date": "2020-10-22",
            "type": "Run",
            "title": "Midweek Tempo",
            "miles": 7.04,
            "minutes": 48,
            "strava": 4231013070,
            "description": "5 miles of work at 6:36 target pace. Got out the door in time to get this solid run in before my meetings, AND the rain!"
        },{
            "date": "2020-10-22",
            "type": "Weight",
            "title": "BodyPump",
            "miles": 0,
            "minutes": 48,
            "strava": 4231013024,
            "description": "An on-demand BodyPump session before dinner. We felt like passing on our scheduled BodyPump session yesterday, so fit it in today (despite running earlier) so we'd have 2x for the week."
        },{
            "date": "2020-10-23",
            "type": "Combat",
            "title": "BodyCombat 83 Express",
            "miles": 0,
            "minutes": 41,
            "strava": 4234449619,
            "description": "Punching, kicking, and capoeira on the front patio. It was HOT today, but the setting sun made this patio workout downright delightful."
        },{
            "date": "2020-10-24",
            "type": "Run",
            "title": "From Clouds to Mist to Sun",
            "miles": 12.03,
            "minutes": 84,
            "strava": 4237189159,
            "description": "I waited for the rain to stop before starting this long run. It was cloudy, then it misted for a while, then the sun came out for the last few miles. All kinds of luscious weather out there this morning! Goal pace 7:10, so mission accomplished!"
        },{
            "date": "2020-10-25",
            "type": "Weight",
            "title": "BodyPump",
            "miles": 0,
            "minutes": 55,
            "strava": 4242215751,
            "description": "Another great BodyPump with Chantelle on our living room television. This felt particularly good because we were able to hit the sauna after we were done."
        },{
            "date": "2020-10-25",
            "type": "Wrap",
            "description": "The weeks are flying by! I enjoyed two hikes this week, along with my standard set of four 10-minute rowing sessions. Feeling really great, and took in a massage this afternoon to loosen up my tight leg muscles."
        },{
            "date": "2020-10-27",
            "type": "Run",
            "title": "Double Tempo",
            "miles": 7.07,
            "minutes": 48,
            "strava": 4249714428,
            "description": "I got my wires crossed this week and was supposed to run intervals today. Instead, I ran the double tempo that was scheduled for Thursday. I guess I’ll be doing intervals on Thursday! Working goal pace was 6:36."
        },{
            "date": "2020-10-28",
            "type": "Weight",
            "title": "BodyPump",
            "miles": 0,
            "minutes": 41,
            "strava": 4257822854,
            "description": "Another great on-demand BodyPump with Amy. Express version 103, you know, from before the pandemic!"
        },{
            "date": "2020-10-29",
            "type": "Run",
            "title": "Swatter Weather",
            "miles": 7.01,
            "minutes": 53,
            "strava": 4258357471,
            "description": "Christina said my Strava map looked like a fly swatter, and it’s getting cooler ... so, swatter weather! 2x(6x400) w/ 90s RI and 2:30 between the sets. Wet and wonderful!"
        },{
            "date": "2020-10-30",
            "type": "Combat",
            "title": "BodyCombat 82 Express",
            "miles": 0,
            "minutes": 41,
            "strava": 4265412503,
            "description": "I felt off this whole workout. It must have been the obscene about of caramel cremes I've been eating lately!"
        },{
            "date": "2020-10-31",
            "type": "Run",
            "title": "Hot Miles",
            "miles": 8.01,
            "minutes": 53,
            "strava": 4267628491,
            "description": "Started off a bit fast for my planned 7:00 miles, but the uphill segment made me temper it a bit. I was stressed for time and knew I had a latte waiting for me at the finish!"
        },{
            "date": "2020-11-01",
            "type": "Weight",
            "title": "BodyPump",
            "miles": 0,
            "minutes": 58,
            "strava": 4273182438,
            "description": "This was a killer Halloween BodyPump mix with Chantelle. I felt like the first two tracks were interminable, but the entire release was a great workout. I like when things are mixed up enough that it all feels novel."
        },{
            "date": "2020-11-01",
            "type": "Wrap",
            "description": "Really, November already? I can't believe it. These training weeks are rolling by quickly, and though this week's long run really wasn't that long, it wasn't really a fallback week, either. Total mileage is right in line with prior weeks. Next week I'll run a 13 again on on the weekend. 8 weeks to my goal race!"
        },{
            "date": "2020-11-03",
            "type": "Run",
            "title": "Repeats for Breakfast",
            "miles": 5.07,
            "minutes": 33,
            "strava": 4280398812,
            "description": "These were big repeats, too. 2x1600 and 2x800. Took 60s between each and a mile to warm up and cool down."
        },{
            "date": "2020-11-04",
            "type": "Weight",
            "title": "BodyPump 111 Express",
            "miles": 0,
            "minutes": 40,
            "strava": 4289605678,
            "description": "At-home BodyPump with Amy. Mission accomplished!"
        },{
            "date": "2020-11-05",
            "type": "Run",
            "title": "Tempolicious",
            "miles": 7.17,
            "minutes": 48,
            "strava": 4289605969,
            "description": "Oh, how I missed the sunshine and warmer temperatures. Blissful for 5 miles of tempo effort."
        },{
            "date": "2020-11-06",
            "type": "Run",
            "title": "Ride, Interrupted",
            "miles": 9.55,
            "minutes": 35,
            "strava": 4298757998,
            "description": "It was such a gorgeous day that we had to go out for a ride. Sadly, though, we had bail after Amy’s bike got a flat. I raced home to fetch our rescue vehicle!"
        },{
            "date": "2020-11-06",
            "type": "Combat",
            "title": "BodyCombat 83 Express",
            "miles": 0,
            "minutes": 37,
            "strava": 4302030230,
            "description": "This was NOT very satisfying since I had to pause for 10 minutes and then resume, but it served as combat for the week, nonetheless."
        },{
            "date": "2020-11-07",
            "type": "Run",
            "title": "Sunshine and Smiles",
            "miles": 13.18,
            "minutes": 92,
            "strava": 4302031279,
            "description": "I was smiling for a lot of this run, but later miles were a tad uncomfortable. Beautiful temperatures for a November Saturday morning!"
        },{
            "date": "2020-11-08",
            "type": "Ride",
            "title": "Sheldrake Ride w/ Amy",
            "miles": 28.28,
            "minutes": 114,
            "strava": 4310545025,
            "description": "A gorgeous Sheldrake ride with Amy. I can’t believe we have these temperatures in November!"
        },{
            "date": "2020-11-08",
            "type": "Wrap",
            "description": "What a roller coaster of a week! Coronavirus roars on, but the week's emotions about political uncertainty crescendoed to a delightful resolution on Saturday. The run workouts were tough this week but I got 'em all in, and it seems like it may be the last week of unseasonably warm temperatures."
        }
    ]
}